{
  "home": {
    "heading": "Home [NL]",
    "paragraph": "Welcome to the react-skeleton, the version you are currently looking at is the demo skeleton that contains dummy code used for previewing the skeleton. If you want to start with a clean project please open up the terminal and run the following:"
  },
  "translations": {
    "introduction": {
      "heading": "Translations [NL]",
      "paragraphs": [
        "Rendering a translation can be done with LocalizedText component that will output the string from the translation file. The LocalizedText component allows for 3 different props: id, formatters and render. The id is used to find the right key in the translation file. The formatters array is used to modify the translated string after it's fetched from the translation file. The render prop is a callback method that can be used to do some custom rendering of the translation file, for example when you want to get an array of string from the translation file and loop through them to render out different paragraphs."
      ]
    },
    "formatters": {
      "heading": "Formatters",
      "paragraphs": [
        "Formatter can be used to modify a localizedText, sometimes you want to replace some variables within a string or do some other manipulation to it. This can be done by adding a prop that includes methods that will modify the original translation. You can apply multiple formatters to the same translation and they will be applied on top of each other. The skeleton only contains 2 formatters but you an easily add custom string methods to the formatters array to modify it!",
        "See below for the included examples:"
      ],
      "example": {
        "replacement": {
          "heading": "ReplaceFormatter",
          "description": "This formatter replaces variables within a string.",
          "text": "The quick brown {animal} jumps over the lazy dog"
        },
        "plural": {
          "heading": "PuralFormatter",
          "description":
          "This formatter chooses the right plural version of a translation based on a number.",
          "text": "The quick brown {fox|count|foxes} jumps over the lazy dog"
        },
        "custom": {
          "heading": "CustomFormatter",
          "description":
          "Apply any custom function as a formatter to modify the string, in this example we add lodash/toUpper",
          "text": "The quick brown fox jumps over the lazy dog"
        }
      }
    }
  }
}
